[
  {
    "role": "Inventory Specialist & Cash Flow",
    "company": "Ekam Indian Groceries, Adelaide, Australia",
    "period": "Dec 2023 – June 2025",
    "responsibilities": [
      "Managed daily purchase entries, invoice verification, attendance tracking, and supplier coordination across dual store locations.",
      "Automated reporting processes and supported cash flow documentation during manager absence.",
      "Handled purchase data and fruit and vegetable invoices using ERP software and advanced Excel functions.",
      "Cross-checked supplier invoices and reconciled statements to prevent overbilling, ensuring financial accuracy.",
      "Maintained staff attendance and created daily cash reports.",
      "Collaborated with the team to support inventory accuracy and operational flow, reducing stock issues significantly."
    ],
    "highlights": "Reduced billing errors and improved invoice match accuracy by 95%. Saved over 4 hours per week through structured Excel logs and automation."
  },
  {
    "role": "GRN Officer",
    "company": "Bansal Supermarket, Surat, India",
    "period": "Dec 2022 – Nov 2023",
    "responsibilities": [
      "Responsible for goods receipt entries, invoice cross-checking, offer updates, and FIFO-based inventory flow.",
      "Maintained operational registers including Top 100/200 item reports.",
      "Conducted regular floor walks and enforced FIFO practices across departments to reduce waste.",
      "Handled PI management, rate updates, and price accuracy for fast-moving items."
    ],
    "highlights": "Reduced stock discrepancies by 30% through enhanced GRN practices. Improved offer accuracy and register organization across 500+ SKUs."
  },
  {
    "role": "Warehouse Supervisor",
    "company": "Arzt Health & Private Limited – Jaipur, India",
    "period": "June 2022 – Nov 2022",
    "responsibilities": [
      "Oversaw stock control, warehouse documentation, and physical inventory across training material storage.",
      "Ensured FIFO handling, audits, and timely replenishment.",
      "Led day-to-day warehouse operations and staff coordination with a strong focus on efficiency.",
      "Maintained accurate bin cards, stock logs, and conducted warehouse audits."
    ],
    "highlights": "Achieved 100% stock availability across training cycles. Streamlined warehouse layout and improved stock handling speed."
  }
]
